# My panda notebook
---

In [13]:
lista = [0,1,2,3,4,5,6]

In [2]:
lista2 = ["Save", "the", "pandas"]

In [7]:
lista[0]

0

In [6]:
lista[1:3]

[1, 2]

In [18]:
for numero in lista:
    print numero

0
1
2
3
4
5
6

In [20]:
len(lista2)

3

In [23]:
range(0, len(lista2))

[0, 1, 2]

In [25]:
for position in range(0, len(lista2)):
    print lista2[position]

Save
the
pandas

In [26]:
for i, element in enumerate(lista2):
    print i
    print element

0
Save
1
the
2
pandas

In [27]:
lista

[0, 1, 2, 3, 4, 5, 6]

In [29]:
[number for number in lista]

[0, 1, 2, 3, 4, 5, 6]

In [31]:
lista3 = [2*number+1 for number in lista]

In [32]:
lista3

[1, 3, 5, 7, 9, 11, 13]

## Dict
---
```python
dic={_:_,_:_}
```

In [33]:
dic={"hell0":2, 3:"guays"}

In [34]:
dic[3]

'guays'

In [37]:
for key in dic:
    print key

hell0
3

In [38]:
for key in dic:
    print dic[key]

2
guays

## Numpy

In [39]:
import numpy as np

In [43]:
array1 = np.array([1,2,3,4])

In [44]:
array1

array([1, 2, 3, 4])

In [45]:
type(array1)

numpy.ndarray

In [46]:
array1+1

array([2, 3, 4, 5])

In [47]:
array1

array([1, 2, 3, 4])

In [48]:
array2 = np.array([1,2,3,4])

In [49]:
array1 + array2

array([2, 4, 6, 8])

In [50]:
%time print "hello"

hello
CPU times: user 60 µs, sys: 42 µs, total: 102 µs
Wall time: 39.8 µs

In [52]:
listamillon = range(0, 1000000)

In [54]:
%time newlist = [number+1 for number in listamillon]

CPU times: user 67.1 ms, sys: 44.4 ms, total: 112 ms
Wall time: 111 ms

In [56]:
arraymillon = np.arange(1000000)

In [57]:
%time newarray = arraymillon+1

CPU times: user 2.7 ms, sys: 487 µs, total: 3.19 ms
Wall time: 2.65 ms

## Pandas
Pandas uses Numpy arrays
___
### Series

In [58]:
import pandas as pd

In [59]:
from pandas import Series

In [62]:
lista2

['Save', 'the', 'pandas']

In [60]:
serie1 = Series(lista2)

In [61]:
serie1

0      Save
1       the
2    pandas
dtype: object

In [63]:
serie2 = Series(lista2, index=[5,6,7])

In [64]:
serie2

5      Save
6       the
7    pandas
dtype: object

In [65]:
serie2.index

Int64Index([5, 6, 7], dtype='int64')

In [66]:
serie2.index.values

array([5, 6, 7])

In [67]:
serie2.values

array(['Save', 'the', 'pandas'], dtype=object)

In [68]:
serie3 = Series(lista2,index=["element1","element2", "element3"])

In [69]:
serie3

element1      Save
element2       the
element3    pandas
dtype: object

In [70]:
lista3

[1, 3, 5, 7, 9, 11, 13]

In [71]:
serie4 = Series(lista3)

In [72]:
serie4

0     1
1     3
2     5
3     7
4     9
5    11
6    13
dtype: int64

In [73]:
serie4+serie4

0     2
1     6
2    10
3    14
4    18
5    22
6    26
dtype: int64

In [77]:
serie5 = Series(lista3, index=[1,2,3,4,5,6,7])

In [78]:
serie4+serie5

0   NaN
1     4
2     8
3    12
4    16
5    20
6    24
7   NaN
dtype: float64

## Pandas DataFrame
___

In [81]:
from pandas import DataFrame

In [82]:
serie6 = 2*serie4

In [83]:
serie6

0     2
1     6
2    10
3    14
4    18
5    22
6    26
dtype: int64

In [84]:
dataframe1 = DataFrame([serie4,serie6])

In [85]:
dataframe1

   0  1   2   3   4   5   6
0  1  3   5   7   9  11  13
1  2  6  10  14  18  22  26

In [86]:
dataframe1 = DataFrame({'col1':serie4,'col2': serie6})

In [87]:
dataframe1

   col1  col2
0     1     2
1     3     6
2     5    10
3     7    14
4     9    18
5    11    22
6    13    26

In [88]:
dataframe1.columns

Index([u'col1', u'col2'], dtype='object')

In [89]:
dataframe1.index

Int64Index([0, 1, 2, 3, 4, 5, 6], dtype='int64')

In [90]:
dataframe1["col1"]

0     1
1     3
2     5
3     7
4     9
5    11
6    13
Name: col1, dtype: int64

In [91]:
dataframe1["col2"]

0     2
1     6
2    10
3    14
4    18
5    22
6    26
Name: col2, dtype: int64

In [93]:
dataframe2 = DataFrame({"col1": [1,2,3], "col2": ["Save","the","Pandas"]})

In [94]:
dataframe2

   col1    col2
0     1    Save
1     2     the
2     3  Pandas

In [95]:
dataframe2["col2"]

0      Save
1       the
2    Pandas
Name: col2, dtype: object

In [97]:
dataframe2["col2"][0]

'Save'

In [98]:
dataframe1

   col1  col2
0     1     2
1     3     6
2     5    10
3     7    14
4     9    18
5    11    22
6    13    26

In [99]:
dataframe1["col3"]=1

In [100]:
dataframe1

   col1  col2  col3
0     1     2     1
1     3     6     1
2     5    10     1
3     7    14     1
4     9    18     1
5    11    22     1
6    13    26     1

In [105]:
dataframe1["col4"]=np.arange(7)

In [106]:
dataframe1

   col1  col2  col3  col4
0     1     2     1     0
1     3     6     1     1
2     5    10     1     2
3     7    14     1     3
4     9    18     1     4
5    11    22     1     5
6    13    26     1     6

In [110]:
np.nan

nan

In [111]:
DataFrame([1,2,3,np.nan])

    0
0   1
1   2
2   3
3 NaN

In [113]:
array100 = np.array([1,2,3,np.nan])

In [114]:
dataframe3 = DataFrame(array100)

In [115]:
dataframe3

    0
0   1
1   2
2   3
3 NaN

In [116]:
dataframe3.dropna()

   0
0  1
1  2
2  3

In [117]:
dataframe3.T

   0  1  2   3
0  1  2  3 NaN

In [119]:
dataframe3.T.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [120]:
dataframe3

    0
0   1
1   2
2   3
3 NaN

In [121]:
dataframe3[0][2]

3.0

In [122]:
dataframe3[0][2] = 6

In [123]:
dataframe3

    0
0   1
1   2
2   6
3 NaN

In [127]:
dataframe3.columns[0]

0

In [128]:
dataframe1

   col1  col2  col3  col4
0     1     2     1     0
1     3     6     1     1
2     5    10     1     2
3     7    14     1     3
4     9    18     1     4
5    11    22     1     5
6    13    26     1     6

In [129]:
indice = dataframe1.index

In [130]:
indice

Int64Index([0, 1, 2, 3, 4, 5, 6], dtype='int64')

In [131]:
indice.values

array([0, 1, 2, 3, 4, 5, 6])

In [132]:
2 in indice

True

In [133]:
7 in indice

False

In [134]:
20 in dataframe1.index

False

In [135]:
dataframe1.columns

Index([u'col1', u'col2', u'col3', u'col4'], dtype='object')

In [137]:
dataframe1.columns = ["Columna1", "Columna2", "Columna3", "Columna4"]

In [138]:
dataframe1

   Columna1  Columna2  Columna3  Columna4
0         1         2         1         0
1         3         6         1         1
2         5        10         1         2
3         7        14         1         3
4         9        18         1         4
5        11        22         1         5
6        13        26         1         6

In [142]:
dataframe1.reindex(columns=["Columna1","nuevo1","nuevo2","nuevo3"])

   Columna1  nuevo1  nuevo2  nuevo3
0         1     NaN     NaN     NaN
1         3     NaN     NaN     NaN
2         5     NaN     NaN     NaN
3         7     NaN     NaN     NaN
4         9     NaN     NaN     NaN
5        11     NaN     NaN     NaN
6        13     NaN     NaN     NaN

In [143]:
dataframe1.reindex([2,3,4])

   Columna1  Columna2  Columna3  Columna4
2         5        10         1         2
3         7        14         1         3
4         9        18         1         4

In [144]:
pd.concat([dataframe1,dataframe1])

   Columna1  Columna2  Columna3  Columna4
0         1         2         1         0
1         3         6         1         1
2         5        10         1         2
3         7        14         1         3
4         9        18         1         4
5        11        22         1         5
6        13        26         1         6
0         1         2         1         0
1         3         6         1         1
2         5        10         1         2
3         7        14         1         3
4         9        18         1         4
5        11        22         1         5
6        13        26         1         6

In [146]:
dataframeconvacios = dataframe1.reindex(columns=["Columna1", "c2", "c3" ])

In [147]:
dataframeconvacios

   Columna1  c2  c3
0         1 NaN NaN
1         3 NaN NaN
2         5 NaN NaN
3         7 NaN NaN
4         9 NaN NaN
5        11 NaN NaN
6        13 NaN NaN

In [150]:
dataframeconvacios.dropna()

Empty DataFrame
Columns: [Columna1, c2, c3]
Index: []

In [151]:
dataframeconvacios.fillna(1)

   Columna1  c2  c3
0         1   1   1
1         3   1   1
2         5   1   1
3         7   1   1
4         9   1   1
5        11   1   1
6        13   1   1

In [152]:
dataframe1["Columna2"][1]

6

In [154]:
#elegir una fila como una serie
dataframe1.ix[1]

Columna1    3
Columna2    6
Columna3    1
Columna4    1
Name: 1, dtype: int64

In [156]:
dataframe1.ix[1]["Columna2"]

6

In [158]:
serie1 = dataframe1["Columna2"]

In [160]:
serie1 > 10

0    False
1    False
2    False
3     True
4     True
5     True
6     True
Name: Columna2, dtype: bool

In [161]:
dataframe1["Columna2"] > 10

0    False
1    False
2    False
3     True
4     True
5     True
6     True
Name: Columna2, dtype: bool

In [162]:
dataframe1[dataframe1["Columna2"] > 10]

   Columna1  Columna2  Columna3  Columna4
3         7        14         1         3
4         9        18         1         4
5        11        22         1         5
6        13        26         1         6

In [170]:
seriecondicion = (dataframe1["Columna2"] > 10) & (dataframe1["Columna4"] > 5)

In [171]:
dataframe1[seriecondicion]

   Columna1  Columna2  Columna3  Columna4
6        13        26         1         6

In [173]:
serie1 =dataframe1["Columna2"]

In [174]:
serie1

0     2
1     6
2    10
3    14
4    18
5    22
6    26
Name: Columna2, dtype: int64

## Apply a function to a DataFrame
___

In [179]:
def suma(val):
    return val + 1

In [180]:
suma(3)

4

In [181]:
dataframe1.applymap(suma)

   Columna1  Columna2  Columna3  Columna4
0         2         3         2         1
1         4         7         2         2
2         6        11         2         3
3         8        15         2         4
4        10        19         2         5
5        12        23         2         6
6        14        27         2         7

In [182]:
#sin crear una nueva función. Uso una función lambda de una sólo línea
#applymap a todos los elementos
dataframe1.applymap(lambda element: 2*element+1)

   Columna1  Columna2  Columna3  Columna4
0         3         5         3         1
1         7        13         3         3
2        11        21         3         5
3        15        29         3         7
4        19        37         3         9
5        23        45         3        11
6        27        53         3        13

In [183]:
#apply a una serie
dataframe1.apply(lambda serie: 2*serie)

   Columna1  Columna2  Columna3  Columna4
0         2         4         2         0
1         6        12         2         2
2        10        20         2         4
3        14        28         2         6
4        18        36         2         8
5        22        44         2        10
6        26        52         2        12

In [184]:
dataframe1.apply(lambda serie: serie.max())

Columna1    13
Columna2    26
Columna3     1
Columna4     6
dtype: int64

In [185]:
#axis=1 aplica la función sobre las filas
dataframe1.apply(lambda serie: serie.max(), axis=1)

0     2
1     6
2    10
3    14
4    18
5    22
6    26
dtype: int64

In [191]:
#dos series con valores min y max
#por columna
dataframe1.apply(lambda serie: Series([serie.min(),serie.max()]))
#por fila: axis=1
#dataframe1.apply(lambda serie: Series([serie.min(),serie.max()]), axis=1)

   Columna1  Columna2  Columna3  Columna4
0         1         2         1         0
1        13        26         1         6

# Loading and saving data
___

In [192]:
import pandas as pd
from pandas import Series,DataFrame

In [194]:
!pwd

/home/dsc/Repositories/Master-in-Data-Science/pandasclass

In [197]:
aircraftdf = pd.read_csv("/home/dsc/Data/opentraveldata/optd_aircraft.csv", sep="^")

In [200]:
aircraftdf.head(10)

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
0,100,Fokker,100,100,2J,F100,2,J
1,141,BAe,146-100,146,4J,B461,4,J
2,142,BAe,BAE Systems 146-200 Passenger,146,4J,B462,4,J
3,143,BAe,146-300,146,4J,B463,4,J
4,146,BAe,146,NaN,NaN,NaN,NaN,NaN
5,14F,BAe,146 Freighter (-100/200/300QT & QC),NaN,NaN,NaN,NaN,NaN
6,14X,BAe,146 Freighter (-100QT & QC),14F,4J,B461,4,J
7,14Y,BAe,146 Freighter (-200QT & QC),14F,4J,B462,4,J
8,14Z,BAe,146 Freighter (-300QT & QC),14F,4J,B463,4,J
9,19D,Airbus,A319,NaN,NaN,NaN,NaN,NaN

In [204]:
len(aircraftdf)

457

In [205]:
aircraftdf.describe()

       nb_engines
count  343.000000
mean     2.408163
std      0.842679
min      1.000000
25%      2.000000
50%      2.000000
75%      3.000000
max      6.000000

In [207]:
aircraftdf.columns

Index([u'iata_code', u'manufacturer', u'model', u'iata_group',
       u'iata_category', u'icao_code', u'nb_engines', u'aircraft_type'],
      dtype='object')

In [211]:
aircraftdf.sort("nb_engines", ascending=False).head(5)

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
145,A5F,Antonov,An-225,A5F,6J,A225,6,J
89,742,Boeing,747-200,747,4J,B742,4,J
106,74V,Boeing,747SR Freighter,74F,4J,B74R,4,J
94,74C,Boeing,747-200 Combi,74M,4J,B742,4,J
368,IL8,Ilyushin,IL-18,IL8,4T,IL18,4,T

In [212]:
dataframe1.rank()

   Columna1  Columna2  Columna3  Columna4
0         1         1         4         1
1         2         2         4         2
2         3         3         4         3
3         4         4         4         4
4         5         5         4         5
5         6         6         4         6
6         7         7         4         7

In [214]:
dataframe1.rank(method="first")

   Columna1  Columna2  Columna3  Columna4
0         1         1         1         1
1         2         2         2         2
2         3         3         3         3
3         4         4         4         4
4         5         5         5         5
5         6         6         6         6
6         7         7         7         7

In [215]:
dataframe1.rank(method="first", ascending=False)

   Columna1  Columna2  Columna3  Columna4
0         7         7         1         7
1         6         6         2         6
2         5         5         3         5
3         4         4         4         4
4         3         3         5         3
5         2         2         6         2
6         1         1         7         1

In [216]:
aircraftdf.sum()

nb_engines    826
dtype: float64

In [217]:
aircraftdf.mean()

nb_engines    2.408163
dtype: float64

In [218]:
aircraftdf.to_csv("salida.csv")

In [219]:
!pwd

/home/dsc/Repositories/Master-in-Data-Science/pandasclass

In [223]:
#en linea de comandos: para instalar la librería de excel
#sudo pip install xlwt
#sudo pip install xlrd
import xlwt
import xlrd
aircraftdf.to_excel("salida.xls")

In [224]:
minidf = aircraftdf.head()

In [225]:
minidf

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
0,100,Fokker,100,100,2J,F100,2,J
1,141,BAe,146-100,146,4J,B461,4,J
2,142,BAe,BAE Systems 146-200 Passenger,146,4J,B462,4,J
3,143,BAe,146-300,146,4J,B463,4,J
4,146,BAe,146,NaN,NaN,NaN,NaN,NaN

In [228]:
minidf.to_dict(orient="records")

[{'aircraft_type': 'J',
  'iata_category': '2J',
  'iata_code': '100',
  'iata_group': '100',
  'icao_code': 'F100',
  'manufacturer': 'Fokker',
  'model': '100',
  'nb_engines': 2.0},
 {'aircraft_type': 'J',
  'iata_category': '4J',
  'iata_code': '141',
  'iata_group': '146',
  'icao_code': 'B461',
  'manufacturer': 'BAe',
  'model': '146-100',
  'nb_engines': 4.0},
 {'aircraft_type': 'J',
  'iata_category': '4J',
  'iata_code': '142',
  'iata_group': '146',
  'icao_code': 'B462',
  'manufacturer': 'BAe',
  'model': 'BAE Systems 146-200 Passenger',
  'nb_engines': 4.0},
 {'aircraft_type': 'J',
  'iata_category': '4J',
  'iata_code': '143',
  'iata_group': '146',
  'icao_code': 'B463',
  'manufacturer': 'BAe',
  'model': '146-300',
  'nb_engines': 4.0},
 {'aircraft_type': nan,
  'iata_category': nan,
  'iata_code': '146',
  'iata_group': nan,
  'icao_code': nan,
  'manufacturer': 'BAe',
  'model': '146',
  'nb_engines': nan}]

In [229]:
#para exportar
minidf.to_json(orient="records")

'[{"iata_code":"100","manufacturer":"Fokker","model":"100","iata_group":"100","iata_category":"2J","icao_code":"F100","nb_engines":2.0,"aircraft_type":"J"},{"iata_code":"141","manufacturer":"BAe","model":"146-100","iata_group":"146","iata_category":"4J","icao_code":"B461","nb_engines":4.0,"aircraft_type":"J"},{"iata_code":"142","manufacturer":"BAe","model":"BAE Systems 146-200 Passenger","iata_group":"146","iata_category":"4J","icao_code":"B462","nb_engines":4.0,"aircraft_type":"J"},{"iata_code":"143","manufacturer":"BAe","model":"146-300","iata_group":"146","iata_category":"4J","icao_code":"B463","nb_engines":4.0,"aircraft_type":"J"},{"iata_code":"146","manufacturer":"BAe","model":"146","iata_group":null,"iata_category":null,"icao_code":null,"nb_engines":null,"aircraft_type":null}]'

In [231]:
fileoutput = open("fichero.json", "w")
fileoutput.write(minidf.to_json(orient="records"))
fileoutput.close()

In [232]:
aircraftdf2 = pd.read_excel("salida.xls")

In [233]:
aircraftdf2

,iata_code,manufacturer,model,iata_group,iata_category,icao_code,nb_engines,aircraft_type
0,100,Fokker,100,100,2J,F100,2,J
1,141,BAe,146-100,146,4J,B461,4,J
2,142,BAe,BAE Systems 146-200 Passenger,146,4J,B462,4,J
3,143,BAe,146-300,146,4J,B463,4,J
4,146,BAe,146,NaN,NaN,NaN,NaN,NaN
5,14F,BAe,146 Freighter (-100/200/300QT & QC),NaN,NaN,NaN,NaN,NaN
6,14X,BAe,146 Freighter (-100QT & QC),14F,4J,B461,4,J
7,14Y,BAe,146 Freighter (-200QT & QC),14F,4J,B462,4,J
8,14Z,BAe,146 Freighter (-300QT & QC),14F,4J,B463,4,J
9,19D,Airbus,A319,NaN,NaN,NaN,NaN,NaN
10,310,Airbus,A310,NaN,NaN,NaN,NaN,NaN
11,312,Airbus,A310-200,310,2J,A310,2,J
12,313,Airbus,A310-300,310,2J,A310,2,J
13,318,Airbus,A318,32S,2J,A318,2,J
14,319,Airbus,A319,32S,2J,A319,2,J
15,31F,Airbus,A310F,NaN,NaN,NaN,NaN,NaN
16,31W,Airbus,A319 (Sharklets),NaN,NaN,NaN,NaN,NaN
17,31X,Airbus,A310-200F,31F,2J,A310,2,J
18,31Y,Airbus,A310-300F,31F,2J,A310,2,J
19,320,Airbus,A320-100/200,32S,2J,A320,2,J
20,321,Airbus,A321-100/200,32S,2J,A321,2,J
21,32A,Airbus,A320 (sharklets),32S,2J,A320,2,J
22,32B,Airbus,A321 (sharklets),32S,2J,A321,2,J
23,32C,Airbus,A318 (sharklets),NaN,NaN,NaN,NaN,NaN
24,32D,Airbus,A319 (sharklets),NaN,NaN,NaN,NaN,NaN
25,32F,Airbus,A320 Freighter,32F,2J,A320,2,J
26,32X,Airbus,A321 Freighter,32X,2J,A321,2,J
27,330,Airbus,A330,NaN,NaN,NaN,NaN,NaN
28,332,Airbus,A330-200,330,2J,A332,2,J
29,333,Airbus,A330-300,330,2J,A333,2,J
...,...,...,...,...,...,...,...,...
427,S76,Sikorsky,S-76,S76,H,S76,NaN,H
428,SF3,Saab,SF340A/B,SF3,2T,SF34,2,T
429,SFB,Saab,SF340B,SF3,2T,SF34,2,T
430,SFF,Saab,SF340 Freighter,SFF,2T,SF34,2,T
431,SH3,Shorts,SD.330,SH3,2T,SH33,2,T
432,SH6,Shorts,SD.360,SH6,2T,SH36,2,T
433,SHB,Shorts,SC-5 Belfast,NaN,NaN,NaN,NaN,NaN
434,SHS,Shorts,SC-7 Skyvan,SHS,2T,SC7,2,T
435,SSC,Aerospatiale / SNIAS,Concorde,NaN,NaN,NaN,NaN,NaN
436,SU1,Sukhoi,Superjet 100,NaN,NaN,NaN,NaN,NaN
437,SU7,Sukhoi,Superjet 100-75,SU1,2J,ZZZZ,2,J
438,SU9,Sukhoi,Superjet 100-95,SU1,2J,SU95,2,J
439,SWF,Fairchild-Swearingen,SA226 Freighter,SWF,2T,*,2,T
440,SWM,Fairchild-Swearingen,SA26 / SA226 / SA227 Metro / Merlin,SWM,2T,*,2,T
441,SY8,Shaanxi,Y-8,SY8,4T,AN12,4,T
442,T20,Tupolev,Tu-204 / Tu-214,T20,2J,T204,2,J
443,T2F,Tupolev,Tu-204 Freighter,T2F,2J,T204,2,J
444,T34,Tupolev,Tu-334,T34,2J,T334,2,J
445,TBM,DAHER-SOCATA,TBM-700,TBM,1T,TBM7,1,T
446,TRN,Surface Equipment,Train,TRN,S,0000,NaN,S
447,TU3,Tupolev,Tu-134,TU3,2J,T134,2,J
448,TU5,Tupolev,Tu-154,TU5,3J,T154,3,J
449,VCV,Vickers,Viscount,NaN,NaN,NaN,NaN,NaN
450,VCX,Vickers,VC-10,NaN,NaN,NaN,NaN,NaN
451,WWP,IAI,1124 Westwind,WWP,2J,WW24,2,J
452,YK2,Yakovlev / Jakovlev,Yak 42,YK2,3J,YK42,3,J
453,YK4,Yakovlev / Jakovlev,Yak 40,YK4,3J,YK40,3,J
454,YN2,HAMC / Harbin,Y12,YN2,2T,Y12,2,T
455,YN7,Xian,Yunshuji Y7,YN7,2T,AN24,2,T
456,YS1,NAMC,YS-11,YS1,2T,YS11,2,T

# Fake Data Creation
___

In [234]:
fake = DataFrame({"col1": range(0,1000)})

In [235]:
fake.head()

   col1
0     0
1     1
2     2
3     3
4     4

In [242]:
fake = DataFrame(np.random.randn(1000,1))

In [243]:
fake

            0
0    0.002242
1   -0.205835
2    0.104376
3    1.031873
4    0.856602
5   -1.185289
6    0.281802
7    0.559526
8   -0.061440
9    1.377338
10   1.919588
11   1.039088
12  -2.141535
13  -0.625409
14   1.849363
15   0.269972
16  -0.860595
17  -0.775782
18  -1.069785
19  -0.869799
20   0.911709
21   2.127145
22  -0.087142
23   1.127737
24   0.567802
25   0.965968
26   0.994474
27  -0.156195
28   0.547662
29   0.168733
..        ...
970 -0.607549
971 -2.447856
972 -1.591205
973  0.290006
974  1.008346
975 -0.008477
976  1.674275
977  1.195040
978  0.794271
979  0.029768
980 -0.834179
981  1.938971
982 -0.716230
983 -0.943582
984 -0.604782
985  1.076731
986  1.611313
987  0.203905
988  0.623932
989 -0.232188
990 -1.164669
991  2.252600
992 -0.943978
993 -1.477763
994  0.223348
995  1.249486
996 -0.816892
997  1.074516
998 -1.013629
999 -0.352411

[1000 rows x 1 columns]

In [244]:
fake.columns = ['Population']

In [245]:
fake.head()

   Population
0    0.002242
1   -0.205835
2    0.104376
3    1.031873
4    0.856602

In [250]:
fake["Population"]=fake.apply(lambda row: int(abs(100*row[0])), axis=1)

In [251]:
fake.head()

   Population
0           0
1          20
2          10
3         103
4          85

## Thank you folks!